notes/meeting_2021oct24.md
- [meeting notes October 24, 2021](#org7b79a99)
  - [the usual links:](#org6b5661d)
    - [meeting notes](#org25216b1)
    - [code examples:](#org3f619f3)
  - [in](#orgc4a80cd)
    - [codesections on multis vs smartmatch, etc](#org20f58fd)
    - [roast tests](#org3c57169)
    - [some third thing because I'm one of those guys](#org5717fb3)
  - [out](#org35c5f8c)
  - [leftovers that I swear I will not leave here in this file](#org125351e)
    - [more on data-handling in raku](#org74bb578)
  - [announcements](#org4f4a3e2)
    - [the ephemeral miniconf: nov 18 2021](#org84a3419)
  - [next meeting](#org806543b)
    - [next meeting: Nov 07, 2021](#org412d024)


<a id="org7b79a99"></a>

# meeting notes October 24, 2021


<a id="org6b5661d"></a>

## the usual links:


<a id="org25216b1"></a>

### meeting notes

1.  <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2021oct24.md>


<a id="org3f619f3"></a>

### code examples:

1.  <https://github.com/doomvox/raku-study/tree/main/bin/2021oct24>


<a id="orgc4a80cd"></a>

## in


<a id="org20f58fd"></a>

### codesections on multis vs smartmatch, etc

1.  <https://www.codesections.com/blog/try-some-pattern-matching/>

2.  <https://www.codesections.com/blog/pattern-matching-2/>

3.  <https://www.reddit.com/r/rakulang/comments/q3mn13/lets_try_some_pattern_matching_codesections/>

4.  <https://www.reddit.com/r/rakulang/comments/q3vstb/further_thoughts_on_raku_pattern_matching/>

5.  <https://stackoverflow.com/questions/66233465/haskell-like-pattern-matching-in-raku>

6.  docs

    | key      | url                                                                          |  |
    |-------- |---------------------------------------------------------------------------- |--- |
    | for      | <https://docs.raku.org/syntax/for>                                           |  |
    | try      | <https://docs.raku.org/language/exceptions#try_blocks>                       |  |
    | sum      | <https://docs.raku.org/routine/sum>                                          |  |
    | whenever | <https://docs.raku.org/language/concurrency#index-entry-whenever>            |  |
    | when     | <https://docs.raku.org/language/control#index-entry-control_flow__when-when> |  |
    | cando    | <https://docs.raku.org/routine/cando>                                        |  |
    |          |                                                                              |  |


<a id="org3c57169"></a>

### roast tests


<a id="org5717fb3"></a>

### some third thing because I'm one of those guys


<a id="org35c5f8c"></a>

## out


<a id="org125351e"></a>

## leftovers that I swear I will not leave here in this file


<a id="org74bb578"></a>

### more on data-handling in raku

1.  <https://stackoverflow.com/questions/66926663/is-there-a-convenient-way-to-replicate-rs-concept-of-named-vectors-in-raku-p/67513527?noredirect=1#comment122449810_67513527>

    1.  William Michaels objects to the word "Row" for a data-record in my solution

2.  arrays-of-objects

    1.  <https://www.reddit.com/r/rakulang/comments/pocomd/a_post_which_came_out_from_a_provocation/hczfj2r/>

3.  Data::Reshapers

    1.  <https://raku.land/cpan:ANTONOV/Data::Reshapers>

4.  "format data into a table"

    <https://unix.stackexchange.com/questions/649799/format-data-into-a-table/655944#655944>

5.  secure json-ification, vadim belman

    1.  <https://colabti.org/irclogger/irclogger_log/raku?date=2021-09-14#l100>
    
    2.  <https://vrurg.github.io/2021/09/14/Secure-JSONification>
    
    3.  <https://www.reddit.com/r/rakulang/comments/pocomd/a_post_which_came_out_from_a_provocation/>

6.  pairs of separators from a string

    1.  <https://www.nntp.perl.org/group/perl.perl6.users/2021/09/msg10138.html>
    
    2.  a discussion yary was involved in, which indicates there's something interesting

7.  lispyness of raku

    1.  <https://www.codesections.com/blog/raku-lisp-impression/>
    
    2.  <https://www.reddit.com/r/rakulang/comments/ptm7qx/rakus_surprisingly_good_lisp_impression/>

8.  old raku weekly

    1.  <https://rakudoweekly.blog/2021/09/20/2021-38-questions-ideas-feedback/>


<a id="org4f4a3e2"></a>

## announcements


<a id="org84a3419"></a>

### the ephemeral miniconf: nov 18 2021

1.  <https://dev.to/thibaultduponchelle/the-ephemeral-miniconf-292j>


<a id="org806543b"></a>

## next meeting


<a id="org412d024"></a>

### next meeting: Nov 07, 2021
